PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/application/Z4A/mza_main_Z4A.c
/**
 * @file mza_main_Z4A.c
 * C entry function for the Z4 A core. The core completes the HW initialization (clocks run
 * at full speed, peripheral bridge is widely opened, SMPU is configured) and initializes a
 * few I/O drivers, e.g. LED drivers and serial I/O with the host. Then it starts the
 * safe-RTOS kernel on the core Z4A. The other cores are not started in this sample.\n
 *   Some CAN messages are sent and received. Polling and interrupt driven patterns are
 * shown. The contents of the sent messages contain previously received input, which
 * enables some checks of the flow. The CAN bus configured to run at 500 kBd. You need to
 * connect a CAN device to connector P5, pins 1 and 2, to see the CAN communication and to
 * provide the input.\n
 *   Two regular tasks are spinning and driving an LED each. A third LED is commanded by
 * the idle task. Only if three LEDs are blinking everything is alright.\n
 *   Progress information is permanently written into the serial output channel. A terminal
 * on the development host needs to use these settings: 115000 Bd, 8 Bit data word, no
 * parity, 1 stop bit.
 *
 * Copyright (C) 2018-2020 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   main
 * Local functions
 *   osTestRxTx_init
 *   osTestRxTx_task10ms
 *   taskInitProcess
 *   task1ms
 *   taskOs1ms
 *   startSecondaryCore
 */

/*
 * Include files
 */

#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <math.h>
#include <assert.h>

#include "MPC5748G.h"
#include "typ_types.h"
#include "ccl_configureClocks.h"
#include "xbs_crossbarSwitch.h"

#include "rtos.h"
#include "gsl_systemLoad.h"
#include "lbd_ledAndButtonDriver.h"
#include "sio_serialIO.h"
#include "del_delay.h"
#include "stm_systemTimer.h"
#include "cdr_canDriverAPI.h"
#include "mza_main_Z4A.h"


/*
 * Defines
 */
 
/** The demo can be compiled with a ground load. Most tasks produce some CPU load if this
    switch is set to 1. */
#define TASKS_PRODUCE_GROUND_LOAD   1

/** We can run the initialization of the CAN interface (in particular: Which messages to
    receive or send) from either user or OS code. */
#define RUN_CAN_INIT_FROM_USER_CODE 1


/*
 * Local type definitions
 */

/** The enumeration of all events, tasks and priorities, to have them as symbols in the
    source code. Most relevant are the event IDs. Actually, these IDs are provided by the
    RTOS at runtime, when creating the event. However, it is guaranteed that the IDs, which
    are dealt out by rtos_osCreateEvent() form the series 0, 1, 2, .... So we don't need
    to have a dynamic storage of the IDs; we define them as constants and double-check by
    assertion that we got the correct, expected IDs from rtos_osCreateEvent(). Note, this
    requires that the order of creating the events follows the order here in the
    enumeration.\n
      Here, we have the IDs of the created events. They occupy the index range starting
    from zero. */
enum
{
    /** Regular timer event. */
    idEv1ms = 0,

    /** The number of tasks to register. */
    noRegisteredEvents
};


/** The RTOS uses constant priorities for its events, which are defined here.\n
      Note, the priority is a property of an event rather than of a task. A task implicitly
    inherits the priority of the event it is associated with. */
enum
{
    prioTaskIdle = 0,            /* Prio 0 is implicit, cannot be chosen explicitly */
    prioEv1ms = 1,
};


/** In safe-RTOS a task belongs to a process, characterized by the PID, 1..4. The
    relationship is defined here.\n
      Note, a process needs to be configured in the linker script (actually: assignment of
    stack space) before it can be used. */
enum
{
    pidOs = 0,              /* kernel always and implicitly has PID 0 */
    pidTask1ms = 1,
    pidTaskOs1ms = pidOs,   /* A kernel or operating system task, e.g. to implement a
                               polling I/O driver. */
    pidTaskIdle = pidOs     /* PID 0 is implicit, idle belongs to the kernel */
};


/*
 * Local prototypes
 */


/*
 * Data definitions
 */

/** Counter of cycles of infinite main loop. */
unsigned long SBSS_OS(mza_cntTaskIdle) = 0;

/** Counter of cyclic 1ms user task. */
unsigned long SBSS_P1(mza_cntTask1ms) = 0;  

/** Counter of cyclic 1ms OS task. */
unsigned long long SBSS_OS(mza_cntTaskOs1ms) = 0;

/** The average CPU load produced by all tasks and interrupts in tens of percent. */
unsigned int DATA_OS(mza_cpuLoad) = 1000;

/** Interface with assembly code: Here's a variable in the assembly startup code, which
    takes the addresses of the C main function to be invoked on core Z4B. It needs to be
    initialized prior to starting the core. Z4B and Z2 may use the same function.
      @todo Why can't we place the declaration locally into the function where it is used?
    The compiler rejects it due to the section attribute. */
extern void (*volatile SECTION(.bss.startup) sup_main_Z4B)(signed int, const char **);

/** Interface with assembly code: Here's a variable in the assembly startup code, which
    takes the addresses of the C main function to be invoked on core Z2. It needs to be
    initialized prior to starting the core. Z4B and Z2 may use the same function. */
extern void (*volatile SECTION(.bss.startup) sup_main_Z2)(signed int, const char **);


/*
 * Function implementation
 */


/**
 * Test of error notification from CAN driver.
 *   @param isCanFD
 * The callback is shared between the two interrupts for normal CAN and CAN FD. So far, our
 * driver doesn't support CAN FD, so this flag should always be \a false.
 *   @param ESR1
 * The value of the CAN devices status register ESR1 on entry into the error interrupt. The
 * bits can be evaluated to see what caused the problem. For details, please refer to RM
 * 43.4.9, p. 1727ff.
 *   @remark
 * This function is called from one of the CAN device's interrupt contexts. It is executed
 * in supervisor mode.
 */
void mza_osCbOnCanError(bool isCanFD ATTRIB_DBG_ONLY, uint32_t ESR1)
{
    assert(!isCanFD);
    
    /* Count occurences. */
    static unsigned int SBSS_OS(noErr_) = 0;
    ++ noErr_;

