PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/application/Z4A/mza_main_Z4A.c
    /* This notification is made very frequently in case of a persistent problem. Most
       likely is the acknowledge error; no consumer of a Tx message is connected to the bus
       and our CAN device will permanently try to send the message. The bus load rises to
       nearly 100% and we can see a notification frequency of several kHz. (Example: 500
       kBd bus, DLC is 8 Byte, the un-acknowledged message has the highest priority among
       all pending messages: this yields about 4k notifications per Second - and this is
       not even the maximum).
         We look at the causing bits and write a message once a second. */
    #define TI_REPORT_IN_TICKS  ((uint32_t)(1000000000u/STM_TIMER_1_PERIOD_IN_NS))
    static uint32_t SBSS_OS(tiLastReport_) = 0;
    uint32_t tiNow = stm_osGetSystemTime(/* idxTimer */ 1);
    if(tiNow - tiLastReport_ > TI_REPORT_IN_TICKS)
    {
        /* The minimum time span to make next report has elapsed. */
        char msg[128]
           , *pWr = &msg[0];
        size_t noAvailChar = sizeof(msg);

        int noChars = sniprintf( pWr, noAvailChar
                               , "mza_osCbOnCanError: %u errors since last report. Last error"
                                 " (ESR1): %08lx. Acknowledge: %u\r\n"
                               , noErr_, ESR1, (ESR1 & CAN_ESR1_ACKERR_MASK) != 0
                               );
        if(noChars > 0)
        {
            pWr += (unsigned)noChars;
            noAvailChar -= (unsigned)noChars;
            noChars = pWr - msg;
            assert((unsigned)noChars < sizeOfAry(msg));
            sio_osWriteSerial(msg, (unsigned)noChars);
        }
        else
            sio_osWriteSerial(SIO_STR(mza_osCbOnCanError: message too long));

        /* We report the delta value of occurences - reset counter. */
        noErr_ = 0;
        tiLastReport_ = tiNow;
    }
    #undef TI_REPORT_IN_TICKS
       
} /* End of mza_cbOnCanError */




/**
 * Test of bus-off notification from CAN driver.
 *   @param enteringBusOff
 * The callback is shared between the two interrupts for entering bus-off state and for
 * recovery from bus-off state. This flag indicates if we now enter the state.
 *   @param ESR1
 * The value of the CAN devices status register ESR1 on entry into the error interrupt. The
 * bits can be evaluated to see what caused the problem. For details, please refer to RM
 * 43.4.9, p. 1727ff.
 *   @remark
 * This function is called from one of the CAN device's interrupt contexts. It is executed
 * in supervisor mode.
 */
void mza_osCbOnCanBusOff(bool enteringBusOff, uint32_t ESR1 ATTRIB_UNUSED)
{
    /* Count occurences and states. Should have ratio 2:1 but who knows. */
    static unsigned int SBSS_OS(noIrqs_) = 0;
    ++ noIrqs_;
    static unsigned int SBSS_OS(noBusOff_) = 0;
    if(enteringBusOff)
        ++ noBusOff_;

    char msg[128]
       , *pWr = &msg[0];
    size_t noAvailChar = sizeof(msg);

    int noChars = sniprintf( pWr, noAvailChar
                           , "mza_osCbOnCanBusOff: %s %uth bus-off situation\r\n"
                           , enteringBusOff? "Entering": "Recovered from"
                           , noBusOff_
                           );
    if(noChars > 0)
    {
        pWr += (unsigned)noChars;
        noAvailChar -= (unsigned)noChars;
        noChars = pWr - msg;
        assert((unsigned)noChars < sizeOfAry(msg));
        sio_osWriteSerial(msg, (unsigned)noChars);
    }
    else
        sio_osWriteSerial(SIO_STR(mza_osCbOnCanError: message too long));

} /* End of mza_cbOnCanError */




/**
 * Test of Rx by FIFO: A callback receives the Rx data and reports the event via the serial
 * output.
 *   @param hMB
 * The handle of the message as agreed on at messge registration time is returned to support
 * a simple association of the Tx event with the transmitted data content.
 *   @param isExtId
 * Standard and extended CAN IDs partly share the same space of number. Hence, we need the
 * additional Boolean information, which of the two the ID \a canId belongs to.
 *   @param canId
 * The standard or extended ID of the transmitted CAN message.
 *   @param DLC
 * Data length code, the number of transmitted content bytes.
 *   @param isAborted
 * A Tx mailbox can be re-filled by the client code before the predesessor had been
 * serialized on the bus. This is called an abort. An abort still yields an acknowledging
 * IRQ and this Boolean flag is set to \a true.
 *   @param timeStamp
 * The time of completing the transmission of the message is recorded by hardware and the
 * value is forwarded to the callback. The absolute value has not meaning, time-base is a
 * free running 16 Bit counter. The frequency of the timer is the CAN bit rate; having a
 * bus with 500 kBd the unit of the timer would be 2µs. The timer wraps around at 2^16-1.
 *   @remark
 * This function is called from one of the CAN device's interrupt contexts. It is executed
 * in supervisor mode. All Rx interrupts share this callback, so it needs to be reentrant
 * if two of them shouldn't have the same interrupt priority.
 */
void mza_osCbOnCANRx( unsigned int hMB
                    , bool isExtId
                    , unsigned int canId
                    , unsigned int DLC
                    , const uint8_t payload[8]
                    , unsigned int timeStamp
                    )
{
    char msg[128]
       , *pWr = &msg[0];
    size_t noAvailChar = sizeof(msg);

    int noChars = sniprintf( pWr, noAvailChar
                           , "Msg %u, ID %u (%s) at %u us: %u Bytes"
                           , hMB
                           , canId
                           , isExtId? "ext": "std"
                           , timeStamp/2 /* unit: 1/500000Bd */
                           , DLC
                           );
    if(noChars > 0)
    {
        pWr += (unsigned)noChars;
        noAvailChar -= (unsigned)noChars;
    }
    else
        return;

    unsigned int u;
    assert(DLC <= 8);
    for(u=0; u<DLC; ++u)
    {
        noChars = sniprintf(pWr, noAvailChar, " %02x", payload[u]);
        if(noChars > 0)
        {
            pWr += (unsigned)noChars;
            noAvailChar -= (unsigned)noChars;
        }
        else
            return;
    }

    noChars = sniprintf(pWr, noAvailChar, "\r\n");
    if(noChars > 0)
    {
        pWr += (unsigned)noChars;
        noAvailChar -= (unsigned)noChars;
    }
    else
        return;

    noChars = pWr - msg;
    assert((unsigned)noChars < sizeOfAry(msg));
    
    /* We abuse this callback, normally run in the OS process, for reporting of message
       reception in a user task. Therefore, we need to dynamically decide whether to call
       the OS function for serial output or the user code equivalent. (It's just a test.
       This style is not what you should adopt for production code...) */
    if((rtos_getCoreStatusRegister() & 0x00004000) == 0)
        sio_osWriteSerial(msg, (unsigned)noChars);
    else    
        sio_writeSerial(msg, (unsigned)noChars);

} /* End of mza_cbOnCANRx */


/**
 * First test: Initialize some mailboxes for Rx and Tx.
 *   @param canDevice
 * This is the CAN device to use by index. See \a cdr_canDevice_t, which enumerates all
 * enabled devices. Actually, this needs to be cdr_canDev_CAN_0, since this is the only CAN
 * device, which is externally connected on the DEVKIT-MPC5748G.
 */
static void testRxTx_init(cdr_enumCanDevice_t canDevice)
{
    /* We can test either the user-code API or the OS API by setting the next macro.
         Caution, it's not a free choice but depends on the context, which we call this
       function from. */
    #if RUN_CAN_INIT_FROM_USER_CODE == 1
    # define makeMailboxReservation cdr_makeMailboxReservation   /* for call from user task */
    #else
    # define makeMailboxReservation cdr_osMakeMailboxReservation /* for call from OS task */
    #endif

