PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/application/Z4A/mza_main_Z4A.c
    cdr_errorAPI_t err ATTRIB_DBG_ONLY;

    /* Register outbound message 0x7f in the first normal mailbox. */
#define H_MBTX_CAN_ID_0X7F   72
    err = makeMailboxReservation( canDevice
                                , /* hMB */ H_MBTX_CAN_ID_0X7F
                                , /* isExtId */ false
                                , /* canId */ 0x7f
                                , /* isReceived */ false
                                , /* TxDLC */ 8
                                , /* doNotify */ false
                                );
    assert(err == cdr_errApi_noError);

    /* Register Rx test message 0x80 in the second normal mailbox for polling. */
#define H_MBRX_CAN_ID_0X80   73
    err = makeMailboxReservation( canDevice
                                , /* hMB */ H_MBRX_CAN_ID_0X80
                                , /* isExtId */ false
                                , /* canId */ 0x80
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ false
                                );
    assert(err == cdr_errApi_noError);

    /* Register two Rx messages in normal mailboxes for polling by a user task. Note, this
       requires explicit granting of access privileges for the given mailbox in the driver
       configuration (file cdr_canDriver.config.inc).
         One of them grants access to a PID <= 2, while our user task is PID=1. We want to
       see an exception on the attempt to access it. */
#define H_MBRX_POLL_CAN_ID_0X7654321_ILLEGAL    81   /* i.e. HW index 81-48=33 */
    err = makeMailboxReservation( canDevice
                                , /* hMB */ H_MBRX_POLL_CAN_ID_0X7654321_ILLEGAL
                                , /* isExtId */ true
                                , /* canId */ 0x7654321
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ false /* 0 is essential for polling */
                                );
    assert(err == cdr_errApi_noError);

#define H_MBRX_POLL_CAN_ID_0X1234567    117     /* i.e. HW index 117-48=69 */
    err = makeMailboxReservation( canDevice
                                , /* hMB */ H_MBRX_POLL_CAN_ID_0X1234567
                                , /* isExtId */ true
                                , /* canId */ 0x1234567
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ false /* 0 is essential for polling */
                                );
    assert(err == cdr_errApi_noError);

    /* Register a Tx message in a normal mailbox for access from a user task. Note, this
       requires explicit granting of access privileges for the given mailbox in the driver
       configuration (file cdr_canDriver.config.inc). */
#define H_MBTX_USER_CAN_ID_0X765        123     /* i.e. HW index 123-48=75 */
    err = makeMailboxReservation( canDevice
                                , /* hMB */ H_MBTX_USER_CAN_ID_0X765
                                , /* isExtId */ false
                                , /* canId */ 0x765
                                , /* isReceived */ false
                                , /* TxDLC */ 8
                                , /* doNotify */ false /* 0 is essential for user access */
                                );
    assert(err == cdr_errApi_noError);

    /* Register some Rx messages with IRQ notification. We want to see some in the same
       mailbox group and at least one in each group.
         Note, the MB handle here is (due to the chosen FIFO size) 48 greater than the HW
       index of the MB. */
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 74        /* MB 26, group 16..31 */
                                , /* isExtId */ false
                                , /* canId */ 0x100
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 76       /* MB 28, group 16..31 */
                                , /* isExtId */ false
                                , /* canId */ 0x101
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 79       /* MB 31, group 16..31 */
                                , /* isExtId */ false
                                , /* canId */ 0x102
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 80       /* MB 32, group 32..63 */
                                , /* isExtId */ false
                                , /* canId */ 0x103
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 111       /* MB 63, group 32..63 */
                                , /* isExtId */ false
                                , /* canId */ 0x104
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 112       /* MB 64, group 64..95 */
                                , /* isExtId */ false
                                , /* canId */ 0x105
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 127       /* MB 79, group 64..95 */
                                , /* isExtId */ false
                                , /* canId */ 0x106
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 143       /* MB 95, group 64..95 */
                                , /* isExtId */ false
                                , /* canId */ 0x107
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    
    /* Register some FIFO Rx messages. */
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 0
                                , /* isExtId */ false
                                , /* canId */ 0x81
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 1
                                , /* isExtId */ false
                                , /* canId */ 0x82
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 2
                                , /* isExtId */ false
                                , /* canId */ 0x83
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 71
                                , /* isExtId */ false
                                , /* canId */ 0x7ff
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 4
                                , /* isExtId */ true
                                , /* canId */ 0x81
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 23
                                , /* isExtId */ true
                                , /* canId */ 0x82
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 25
                                , /* isExtId */ true
                                , /* canId */ 0x83
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    err = makeMailboxReservation( canDevice
                                , /* hMB */ 70
                                , /* isExtId */ true
                                , /* canId */ 0x7ff
                                , /* isReceived */ true
                                , /* TxDLC */ 0 /* value doesn't care for Rx */
                                , /* doNotify */ true
                                );
    assert(err == cdr_errApi_noError);
    #undef makeMailboxReservation

} /* testRxTx_init */



/**
 * First test: Get/send some Rx/Tx messages.
 *   @param canDevice
 * This is the CAN device to use by index. See \a cdr_enumCanDevice_t, which enumerates all
 * enabled devices. Actually, this needs to be cdr_canDev_CAN_0, since this is the only CAN
 * device, which is externally connected on the DEVKIT-MPC5748G.
 */
static void osTestRxTx_task10ms(cdr_enumCanDevice_t canDevice)
{
    /* Make an integer from the zero based device enumeration. */
    const unsigned idxCanDevice ATTRIB_DBG_ONLY = (unsigned)canDevice;
    assert(idxCanDevice == 0);

    static uint16_t SBSS_OS(cnt_) = 0;
    ++ cnt_;
    
    static unsigned int SDATA_OS(noRxEvent_) = 0;
    static unsigned int SDATA_OS(noTxErr_) = 0;

    /* Initial test: Send a message every 10ms. */
    
    /* Fill data in the mailbox. */
    union
    {
        uint8_t payload[8];
        uint16_t payload_u16[4];
        uint32_t payload_u32[2];

