PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/application/Z4A/mza_main_Z4A.c
    } static DATA_OS(payload_) = { .payload_u32 = {[0] = 0, [1] = 0} };
    payload_.payload_u16[1] = (uint16_t)(noRxEvent_ & 0x0000ffffu);
    payload_.payload_u16[2] = (uint16_t)(noTxErr_ & 0x0000ffffu);
    payload_.payload_u16[3] = cnt_;

    /* Send the message. We try both alternative APIs. One of them permits using the
       mailbox for different DLC and CAN Id, too.*/
    if((cnt_ & 0x70) != 0)
    {
        /* Most of the time we use the simple API. */
        if(cdr_osSendMessage( /* idxCanDevice */ cdr_canDev_CAN_0
                            , /* hMB */ H_MBTX_CAN_ID_0X7F
                            , &payload_.payload[0]
                            )
           != cdr_errApi_noError
          )
        {
            ++ noTxErr_;
        }
    }
    else
    {
        /* From time to time we use the extended API. DLC and CAN ID are chosen such that
           they end with 8 or 127, respectively before we switch back to the simple API -
           which continues with these values. */ 
        unsigned int DLC = ((cnt_ & 0xfu)+1u) / 2u
                   , canId = 127u - 8u + DLC;
        bool isExtId = canId <= 125;
        if(cdr_osSendMessageEx( /* idxCanDevice */ cdr_canDev_CAN_0
                              , /* hMB */ H_MBTX_CAN_ID_0X7F
                              , isExtId
                              , canId
                              , DLC
                              , &payload_.payload[0]
                              )
           != cdr_errApi_noError
          )
        {
            ++ noTxErr_;
        }
        
    }
    
    
    /* Poll for newly received input. */
    uint8_t DLC = 8;
    uint8_t payloadRx[DLC];
    uint16_t timeStampRx;
    const cdr_errorAPI_t resultRx = cdr_osReadMessage( /* idxCanDevice */ cdr_canDev_CAN_0
                                                     , /* hMB */ H_MBRX_CAN_ID_0X80
                                                     , &DLC
                                                     , &payloadRx[0]
                                                     , &timeStampRx
                                                     );
    if(resultRx != cdr_errApi_rxMailboxEmpty)
    {
        ++ noRxEvent_;

        /* Copy first received bytes into Tx test message. 2 Bytes are left. */
        unsigned int u;
        for(u=0; u<2 && u<DLC; ++u)
            payload_.payload[u] = payloadRx[u];
    }
} /* osTestRxTx_task10ms */




/**
 * Initialization task of process 1.
 *   @return
 * The function returns the Boolean descision, whether the initialization was alright and
 * the system can start up. "Not alright" is expressed by a negative number, which hinders
 * the RTOS from starting up.
 *   @param PID
 * The ID of the process, the task function is executed in. This function is associated
 * with prcess 1, so we expect to see only this value.
 */
static int32_t taskInitProcess1(uint32_t PID ATTRIB_DBG_ONLY)
{
    static unsigned int DATA_P1(cnt_) ATTRIB_DBG_ONLY = 0;
    ++ cnt_;
    assert(PID == 1  &&  cnt_ == 1);

    /* Configure the mailboxes in the CAN driver appropriately for our test. */
    #if RUN_CAN_INIT_FROM_USER_CODE == 1
    testRxTx_init(cdr_canDev_CAN_0);
    #endif
    
    iprintf("taskInitProcess1: CAN communication successfuly set up\r\n");

    return 0;

} /* End of taskInitProcess1 */



/**
 * Test of LED and button driver: This callback is invoked on every state change of any of
 * the supported (two) buttons.
 *   @return
 * The function always returns zero (no error).
 *   @param PID
 * PID of process, which is registered for the callback.
 *   @param buttonState
 * Current state of both buttons and changes in the instance of calling. See enum
 * lbd_buttonStateMask_t for details.
 */
static int32_t onButtonChangeCallback(uint32_t PID ATTRIB_UNUSED, uint8_t buttonState)
{
    /* Test button input: The current status is echoed as LED status. */
    if((buttonState & lbd_btStMask_btnSw1_down) != 0)
        lbd_setLED(lbd_led_6_DS5,  /* isOn */ true);
    else if((buttonState & lbd_btStMask_btnSw1_released) != 0)
        lbd_setLED(lbd_led_6_DS5,  /* isOn */ false);
              
    return 0;    

} /* End of onButtonChangeCallback */


/**
 * Task function, cyclically activated every Millisecond. The LED D4 is switched on and off.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process.
 *   @param PID
 * A user task function gets the process ID as first argument.
 *   @param taskParam
 * A variable task parameter. Here just used for testing.
 */
static int32_t task1ms(uint32_t PID ATTRIB_UNUSED, uintptr_t taskParam ATTRIB_DBG_ONLY)
{
    assert(taskParam == 0);

    /* Make spinning of the task observable in the debugger. */
    ++ mza_cntTask1ms;

#if TASKS_PRODUCE_GROUND_LOAD == 1
    /* Produce a bit of CPU load. This call simulates some true application software. */
    del_delayMicroseconds(/* fullLoadThisNoMicroseconds */ 50 /* approx. 5% load */);
#endif

    static int SBSS_P1(cntIsOn_) = 0;
    if(++cntIsOn_ >= 500)
    {
        cntIsOn_ = -500;
        printf("task1ms: This is call %lu of task1ms\r\n", mza_cntTask1ms);
    }
    lbd_setLED(lbd_led_0_DS11, /* isOn */ cntIsOn_ >= 0);

    /* Poll mailbox for new CAN input. Only the first time, we need to request the
       reference to the API buffer in use. */
    static unsigned int DATA_P1(noMsgNotReported_) = 0;
    static const cdr_apiBufferRxPolling_t * SDATA_P1(pAPIBuffer_) = NULL;
    if(pAPIBuffer_ == NULL)
    {
        pAPIBuffer_ = cdr_getRxPollingAPIBuffer( cdr_canDev_CAN_0
                                               , H_MBRX_POLL_CAN_ID_0X1234567
                                               );
        assert(pAPIBuffer_ != NULL);
    }
   cdr_errorAPI_t errCode = cdr_readMessage( cdr_canDev_CAN_0
                                           , H_MBRX_POLL_CAN_ID_0X1234567
                                           );
    if(errCode == cdr_errApi_noError  ||  errCode == cdr_errApi_warningRxOverflow)
    {
        static unsigned int DATA_P1(tiLastReport_) = 0;

        if(mza_cntTask1ms - tiLastReport_ >= 100 /* ms */)
        {
            tiLastReport_ = mza_cntTask1ms;
            if(noMsgNotReported_ > 0)
            {
                printf( "task1ms: %u messages have been received meanwhile without"
                        " reporting\r\n"
                      , noMsgNotReported_
                      );
                noMsgNotReported_ = 0;
            }
                
            /* Reporting: We can re-use our callback for IRQ enabled messages. */
            printf("task1ms: ");
            mza_osCbOnCANRx( H_MBRX_POLL_CAN_ID_0X1234567
                           , /* isExtId */ true
                           , /* canId */ 0x1234567
                           , /* DLC */ (unsigned)pAPIBuffer_->DLC
                           , &pAPIBuffer_->payload_u8[0]
                           , pAPIBuffer_->timeStamp
                           );
        }
        else
            ++ noMsgNotReported_;
    }
    
    /* In every task tick, send a message. This proves the use of the (constrained) user
       code Tx API to the CAN stack: The only thing, we are allowed to do is sending other
       payload (but same CAN ID, same DLC) and only for particular mailboxes. */
    static uint8_t DATA_P1(payload_)[8] = {[0 ... 5] = 0xff, [6 ... 7] = 0, };
    _Static_assert(sizeof(mza_cntTask1ms) <= sizeof(payload_), "Internal error");
    memcpy(payload_, &mza_cntTask1ms, sizeof(mza_cntTask1ms));
    errCode = cdr_sendMessage( cdr_canDev_CAN_0
                             , H_MBTX_USER_CAN_ID_0X765
                             , payload_
                             );
    payload_[4] = errCode;
    if(errCode != cdr_errApi_noError) /* Make sporadic errors sticky in a most simple way. */
    {
        ++ payload_[6];
        payload_[7] = errCode; 
    }
    
    /* Inject some errors. */
    if((mza_cntTask1ms & 0x3ff) == 0)
    {
        static volatile unsigned int DATA_P2(foreignData) ATTRIB_UNUSED;
        foreignData = (unsigned int)mza_cntTask1ms;
    }
    if((mza_cntTask1ms & 0x7ff) == 1)
    {
        /* Try to access a mailbox by polling, which is not accessible for this user
           process. The first function would still succeed, but we must not use the read
           method. */
        const cdr_apiBufferRxPolling_t * const pAPIBuffer ATTRIB_UNUSED =
                            cdr_getRxPollingAPIBuffer( cdr_canDev_CAN_0
                                                     , H_MBRX_POLL_CAN_ID_0X7654321_ILLEGAL
                                                     );

        const cdr_errorAPI_t errCode = cdr_readMessage( cdr_canDev_CAN_0
                                                      , H_MBRX_POLL_CAN_ID_0X7654321_ILLEGAL
                                                      );

        /* We must never get here. */
        printf( "task1ms: Error: Got access to prohibitted mailbox (%u)"
                " H_MBRX_POLL_CAN_ID_0X7654321_ILLEGAL\r\n"
              , errCode
              );
        assert(false);
    }

