PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/application/Z4A/mza_main_Z4A.c
    /* Demonstrate the use of the diagnostic API. Print status information every few
       seconds. */
    if((mza_cntTask1ms & 0xfff) == 2)
    {
        /* Info from interrupt group bus off. */
        const unsigned int noBusOffEv = cdr_getNoBusOffEvents(cdr_canDev_CAN_0);
        if(noBusOffEv > 0)
            printf("task1ms: Total number of bus off events so far: %u\r\n", noBusOffEv);
                  
        /* Info from interrupt group FIFO. */
        const unsigned int warnFifoNearlyFull = cdr_getNoRxFifoEvents
                                                    ( cdr_canDev_CAN_0
                                                    , cdr_rxEv_warningNearlyFull
                                                    )
                         , errFifoOverflow = cdr_getNoRxFifoEvents
                                                    ( cdr_canDev_CAN_0
                                                    , cdr_rxEv_errorOverflow
                                                    )
                         , noRxFifo = cdr_getNoRxFifoEvents
                                                    ( cdr_canDev_CAN_0
                                                    , cdr_rxEv_reception
                                                    );
        printf( "task1ms: Total number of\r\n"
                "  Rx FIFO messages:  %u\r\n"
                "  FIFO nearly full:  %u\r\n"
                "  FIFO message lost: %u\r\n"
              , noRxFifo
              , warnFifoNearlyFull
              , errFifoOverflow
              );

        /* Info from interrupt group Error. */
        const unsigned int noErrorEv = cdr_getNoErrorEvents(cdr_canDev_CAN_0);
        const uint16_t lastErr = cdr_getLastTransmissionError(cdr_canDev_CAN_0);
        if(noErrorEv > 0)
        {
            printf("task1ms: Total number of transmission errors: %u\r\n", noErrorEv);
            printf( "task1ms: Last error: %u\r\n"
                    "BIT1ERR: %u\r\n"
                    "BIT0ERR: %u\r\n"
                    "ACKERR: %u\r\n"
                    "CRCERR: %u\r\n"
                    "FRMERR: %u\r\n"
                    "STFERR: %u\r\n"
                  , lastErr
                  , (lastErr & CAN_ESR1_BIT1ERR_MASK) != 0
                  , (lastErr & CAN_ESR1_BIT0ERR_MASK) != 0
                  , (lastErr & CAN_ESR1_ACKERR_MASK) != 0
                  , (lastErr & CAN_ESR1_CRCERR_MASK) != 0
                  , (lastErr & CAN_ESR1_FRMERR_MASK) != 0
                  , (lastErr & CAN_ESR1_STFERR_MASK) != 0
                  );
        }
    }
    
    return 0;

} /* End of task1ms */



/**
 * OS task function, cyclically activated every Millisecond. Used to clock the step
 * functions of our I/O drivers.\n
 *   This task is run in supervisor mode and it has no protection. The implementation
 * belongs into the sphere of trusted code.
 *   @param taskParam
 * A variable task parameter. Here just used for testing.
 */
static void taskOs1ms(uintptr_t taskParam ATTRIB_DBG_ONLY)
{
    assert(taskParam == 0);

    /* Make spinning of the task observable in the debugger. */
    ++ mza_cntTaskOs1ms;

    /** Regularly called step function of the I/O driver. */
    lbd_osTask1ms();

#if TASKS_PRODUCE_GROUND_LOAD == 1
    /* Produce a bit of CPU load. This call simulates some true application software. */
    del_delayMicroseconds(/* fullLoadThisNoMicroseconds */ 75 /* approx. 7.5% load */);
#endif

    /* Test button input: The current status is echoed as LED status. */
    lbd_osSetLED(lbd_led_7_DS4,  /* isOn */ lbd_osGetButton(lbd_bt_button_SW2));
              
    static int SBSS_OS(cntIsOn_) = 0;
    if(++cntIsOn_ >= 500)
    {
        cntIsOn_ = -500;

        printf("This is call %llu of taskOs1ms\r\n", mza_cntTaskOs1ms);
    }
    lbd_osSetLED(lbd_led_1_DS10, /* isOn */ cntIsOn_ >= 0);
    
    if((mza_cntTaskOs1ms % 10) == 1)
        osTestRxTx_task10ms(cdr_canDev_CAN_0);

} /* End of taskOs1ms */



#if 0
/**
 * Start a secondary core. The initial core is already started and it is the one, which will
 * execute this function. Never call the function from another core than Z4A.
 *   @param idxCore
 * Which core to start? Permitted indexes are 1 for the Z4B core and 2 for the Z2 core.
 *   @param main
 * The main function to be used for the secondary core. Although it might be tempting to
 * have one and the same main function for all cores, the normal function main must not be
 * passed: The compiler generates special code on entry into C's main() to initialize the C
 * runtime. If C's main() is called for more than a single core then this initializtaion
 * happens repeatedly and maybe even coincidentally; either of this can make the runtime
 * fail.
 */
static void startSecondaryCore( unsigned int idxCore
                              , void (*main)(signed int, const char *[])
                              )
{
    /* The entry point into the C code cannot be the normal main function for the other
       cores. The C compiler unconditionally generates the call of the C run time
       initialization as part of the machine code that implements the entry into main. We
       must of course not execute this initialization three times. Instead, we pass the
       main function for the other cores explicitly to the startup code. Although this
       effectively is cross-core communication we don't have any issues with it; the other
       core is not yet running, has not filled any data into its cache and the output write
       buffers of the Z4A core, which executes this code here will be written through its
       cache into external memory long before the other core actually reaches the location
       in the startup code where the function pointer is read. */

    /* Interface with assembly startup code. (There's no header file for the assembly
       startup code.): The entry point into code execution after reset. Common for all
       three cores. */
    extern void _Noreturn sup_startUp(void);
    
    /* Prepare core start: Enter code start address and set allowed run modes. */
    switch(idxCore)
    {
    case 1 /* Z4B */:
        /* Pass the pointer to the C code entry to the assembly startup code being executed
           on the other core. Note, all core use the same startup code. This code is
           conditionally in that it reads a core dependent address of the C main function
           to use. */
        sup_main_Z4B = main;
        std_fullMemoryBarrier();

