PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/application/Z4A/mza_main_Z4A.c
        /* RM 38.3.91, p. 1209: The core is enabled in all run modes. Caution, the RM names
           the three cores 1, 2 and 3, while in SW (as the argument of this function does)
           we normally count from zero. */
        MC_ME->CCTL2 = 0x00fc;

        /* RM, 38.3.94, p. 1214: Reset vector for core 1. Why do we need to set this
           vector? It had already been entered in the boot sector, the BAF. */
        MC_ME->CADDR2 = (uint32_t)sup_startUp | MC_ME_CADDR2_RMC(1);

        break;

    case 2 /* Z2 */:
        /* Pass the pointer to the C code entry to the assembly startup code being executed
           on the other core. See case Z4B for details. */ 
        sup_main_Z2 = main;
        std_fullMemoryBarrier();

        /* RM 38.3.92, p. 1211: The core is enabled in all run modes. */
        MC_ME->CCTL3 = 0x00fc;

        /* RM, 38.3.95, p. 1215: Reset vector for core 2. */
        MC_ME->CADDR3 = (uint32_t)sup_startUp | MC_ME_CADDR3_RMC(1);

        break;

    default:
        /* Core 0 is always running and there are no other cores on this hardware. */
        assert(false);
    }

    /* RM 38.3.94: Another core is started on the next run mode change. We trigger a
       transition from DRUN to DRUN. On return from this function call, the other core is
       running in parallel. */
    ccl_triggerTransitionToModeDRUN();

} /* End of startSecondaryCore */
#endif


/**
 * C entry function main. Is used for and only for Z4A core.
 *   @return
 * Actually, the function is a _Noreturn. We don't declare it as such in order to avoid a
 * compiler warning. 
 *   @param noArgs
 * Number of arguments in \a argAry. Is actually always equal to one.
 *   @param argAry
 * Array of string arguments to the function. Actually, always a single string which equals
 * the name of the core, which is started.
 */
int /* _Noreturn */ main(int noArgs ATTRIB_DBG_ONLY, const char *argAry[] ATTRIB_DBG_ONLY)
{
    assert(noArgs == 1  && strcmp(argAry[0], "Z4A") == 0);

    /* Complete the core HW initialization - as far as not yet done by the assembly startup
       code. */
    
    /* All clocks run at full speed, including all peripheral clocks. */
    ccl_configureClocks();          
    
    /* Interrupts become usable and configurable by SW. */
    rtos_osInitINTCInterruptController();
    
    /* Configuration of cross bars: All three cores need efficient access to ROM and RAM.
       By default, the cores generally have strictly prioritized access to all memory slave
       ports in order Z4A, I-Bus, Z4A, D-Bus, Z4B, I-Bus, Z4B, D-Bus, Z2, I-Bus, Z2, D-Bus.
       While not optimal it is at least acceptable for most ports - with the exception of
       slave port 3 of cross bar 0: This port is the only path for the D buses of Z4B and
       Z2 (see RM, 16.1.1, table 16-1, p. 409) and Z2 suffers from starvation if Z4B is
       heavily transferring data. This can happen in our example, where all cores are
       spinning in a tiny loop to increment some counters in RAM. The minimum action to
       take is setting this port to round robin arbitration. */
    xbs_configCrossbarSwitch(/* isZ2IOCore */ true);

    /* The core is now running in the desired state. I/O driver initialization follows to
       the extend required by this simple sample. */
    
    /* Start the system timers for execution time measurement.
         Caution: On the MPC5748G, this is not an opton but an essential prerequisite for
       running safe-RTOS. The MPC5748G has a simplified z4 core without the timebase
       feature. The system timer is used as substitute. The driver needs to be started and
       it must be neither changed nor re-configured without carefully double-checking the
       side-effects on the kernel! */
    stm_osInitSystemTimers();
    
    /* Initialize the button and LED driver for the eval board. Shape access to the eight
       user LEDs and two user buttons. */
    lbd_osInitLEDAndButtonDriver( /* onButtonChangeCallback_core0 */ onButtonChangeCallback
                                , /* PID_core0 */                    1
                                , /* onButtonChangeCallback_core1 */ NULL
                                , /* PID_core1 */                    0
                                , /* onButtonChangeCallback_core2 */ NULL
                                , /* PID_core2 */                    0   
                                , /* tiMaxTimeInUs */                1000
                                );

    /* Initialize the serial output channel as prerequisite of using printf. */
    sio_osInitSerialInterface(/* baudRate */ 115200);

    /* Initialize the CAN driver. */
    cdr_osInitCanDriver();

    /* Configure the mailboxes in the CAN driver appropriately for our test. */
    #if RUN_CAN_INIT_FROM_USER_CODE != 1
    testRxTx_init(cdr_canDev_CAN_0);
    #endif

    /* Route the CLOCKOUTs 0 and 1 from the clock generation module to the external pins
       PG7 and PG6, respectively. They are available at connector J3-16 and J3-14. The
       devided core clocks should be visible as a 10 and a 2 MHz signal. */
    SIUL2->MSCR[103 /* PG7 */] =
                SIUL2_MSCR_SSS(3)   /* CLOCKOUT0 */
                | SIUL2_MSCR_SRC(3) /* Slew rate: Full drive without SR control */
                | SIUL2_MSCR_OBE(1) /* Enable output buffer */
                | SIUL2_MSCR_ODE(0) /* Disable open drain, drive both edges */
                | SIUL2_MSCR_SMC(1) /* Safe mode as after reset */
                | SIUL2_MSCR_APC(0) /* No analog I/O */
                | SIUL2_MSCR_IBE(0) /* Disable input buffer */
                | SIUL2_MSCR_HYS(1) /* Hysteresis as after reset */
                | SIUL2_MSCR_PUE(0) /* Pull up/down is disabled */
                | SIUL2_MSCR_PUS(0) /* Pull up/down doesn't care, is disabled */
                ;
    SIUL2->MSCR[102 /* PG6 */] =
                SIUL2_MSCR_SSS(3)   /* CLOCKOUT1 */
                | SIUL2_MSCR_SRC(3) /* Slew rate: Full drive without SR control */
                | SIUL2_MSCR_OBE(1) /* Enable output buffer */
                | SIUL2_MSCR_ODE(0) /* Disable open drain, drive both edges */
                | SIUL2_MSCR_SMC(1) /* Safe mode as after reset */
                | SIUL2_MSCR_APC(0) /* No analog I/O */
                | SIUL2_MSCR_IBE(0) /* Disable input buffer */
                | SIUL2_MSCR_HYS(1) /* Hysteresis as after reset */
                | SIUL2_MSCR_PUE(0) /* Pull up/down is disabled */
                | SIUL2_MSCR_PUS(0) /* Pull up/down doesn't care, is disabled */
                ;

